Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/edc/PIC32MM0064GPL036.PIC
      <edc:SFRDef edc:_addr="0x1F802650" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="----------------------n----nnnnn" edc:cname="CNPUA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff021f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0----00000" edc:name="CNPUA" edc:nzwidth="0x20" edc:por="----------------------0----00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUA0" edc:desc="" edc:mask="0x1" edc:name="CNPUA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA1" edc:desc="" edc:mask="0x1" edc:name="CNPUA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA2" edc:desc="" edc:mask="0x1" edc:name="CNPUA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA3" edc:desc="" edc:mask="0x1" edc:name="CNPUA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA4" edc:desc="" edc:mask="0x1" edc:name="CNPUA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUA9" edc:desc="" edc:mask="0x1" edc:name="CNPUA9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802660" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="----------------------n----nnnnn" edc:cname="CNPDA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff021f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0----00000" edc:name="CNPDA" edc:nzwidth="0x20" edc:por="----------------------0----00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDA0" edc:desc="" edc:mask="0x1" edc:name="CNPDA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA1" edc:desc="" edc:mask="0x1" edc:name="CNPDA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA2" edc:desc="" edc:mask="0x1" edc:name="CNPDA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA3" edc:desc="" edc:mask="0x1" edc:name="CNPDA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA4" edc:desc="" edc:mask="0x1" edc:name="CNPDA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDA9" edc:desc="" edc:mask="0x1" edc:name="CNPDA9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802670" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="----------------n---n-----------" edc:cname="CNCONA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffdbff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00--0-----------" edc:name="CNCONA" edc:nzwidth="0x20" edc:por="----------------00--0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="10"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTYLE" edc:desc="" edc:mask="0x1" edc:name="CNSTYLE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802680" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="----------------------n----nnnnn" edc:cname="CNEN0A" edc:desc="" edc:grp="PORTA" edc:impl="0xffc0021f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0----00000" edc:name="CNEN0A" edc:nzwidth="0x20" edc:por="----------------------0----00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIE0A0" edc:desc="" edc:mask="0x1" edc:name="CNIE0A0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A1" edc:desc="" edc:mask="0x1" edc:name="CNIE0A1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A2" edc:desc="" edc:mask="0x1" edc:name="CNIE0A2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A3" edc:desc="" edc:mask="0x1" edc:name="CNIE0A3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A4" edc:desc="" edc:mask="0x1" edc:name="CNIE0A4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A9" edc:desc="" edc:mask="0x1" edc:name="CNIE0A9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802690" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="----------------------n----nnnnn" edc:cname="CNSTATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff021f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------x----xxxxx" edc:name="CNSTATA" edc:nzwidth="0x20" edc:por="----------------------x----xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATA0" edc:desc="" edc:mask="0x1" edc:name="CNSTATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA1" edc:desc="" edc:mask="0x1" edc:name="CNSTATA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA2" edc:desc="" edc:mask="0x1" edc:name="CNSTATA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA3" edc:desc="" edc:mask="0x1" edc:name="CNSTATA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA4" edc:desc="" edc:mask="0x1" edc:name="CNSTATA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA9" edc:desc="" edc:mask="0x1" edc:name="CNSTATA9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
